app/views/actors/edit.html.erb

    <% end %>
    <% if User.find(session[:user_id]).email == "kraewind@gmail.com" %>
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]