app/views/viewings/index.html.erb

SELECT "viewings".* FROM "viewings" WHERE "viewings"."user_id" = ?  [["user_id", 1]]
---

<% if @user.viewings.any? { |v| v.time < Time.now } %>
<% @user.viewings.each do |viewing| %>