app/views/viewings/new.html.erb

            <%= f.label :show_id, class: "form-label"  %>
            <%= f.collection_select :show_id, Show.all, :id, :title, prompt: true, class: "form-label" %>
---
SELECT "shows".* FROM "shows" ORDER BY "shows"."title" ASC