app/views/users/show.html.erb

SELECT "shows".* FROM "shows" INNER JOIN "viewings" ON "shows"."id" = "viewings"."show_id" WHERE "viewings"."user_id" = ?  [["user_id", 1]]
SELECT 1 AS one FROM "shows" INNER JOIN "viewings" ON "shows"."id" = "viewings"."show_id" WHERE "viewings"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
---
<ul>
  <% if @user.shows.any? %>

SELECT "viewings".* FROM "viewings" WHERE "viewings"."user_id" = ?  [["user_id", 1]]
---
<ul>
<% if @user.viewings.any? { |v| v.time >= Time.now } %>