app/helpers/application_helper.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def delete_if_admin(resource)
        if User.find(session[:user_id]).email == "kraewind@gmail.com"