app/helpers/characters_helper.rb

    def display_show_portion_conditionally(f, character)
         if character.show_id == nil


                f.label :show_id, class: "form-label"
                f.collection_select :show_id, Show.all, :id, :title, prompt: true, class: "form-label"
---
SELECT "shows".* FROM "shows" ORDER BY "shows"."title" ASC