app/views/characters/edit.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---

    <% if User.find(session[:user_id]).email == "kraewind@gmail.com" %>