app/views/characters/new.html.erb

            <%= f.label :actor_id, class: "form-label"  %>
            <%= f.collection_select :actor_id, Actor.all, :id, :name, prompt: true, class: "form-label" %>
---
SELECT "actors".* FROM "actors" ORDER BY "actors"."name" ASC

                <%= f.label :show_id, class: "form-label"  %>
                <%= f.collection_select :show_id, Show.all, :id, :title, prompt: true, class: "form-label" %>
---
SELECT "shows".* FROM "shows" ORDER BY "shows"."title" ASC