app/controllers/actors_controller.rb

    def index

        @actors = Actor.all
---
SELECT "actors".* FROM "actors"

    def create
        @actor = Actor.create(actor_params)
---
INSERT INTO "actors" ("name", "dob", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Masahiro Genki"], ["dob", "0987-01-23 00:00:00"], ["created_at", "2021-04-01 18:09:22.309482"], ["updated_at", "2021-04-01 18:09:22.309482"]]

    def show

        @actor = Actor.find_by_id(params[:id])
---
SELECT "actors".* FROM "actors" WHERE "actors"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def edit

        @actor = Actor.find_by_id(params[:id])
---
SELECT "actors".* FROM "actors" WHERE "actors"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def update

        @actor = Actor.find(params[:id])
        @actor.update(actor_params)
---
SELECT "actors".* FROM "actors" WHERE "actors"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "actors" SET "dob" = ?, "updated_at" = ? WHERE "actors"."id" = ?  [["dob", "1995-03-11"], ["updated_at", "2021-04-07 02:54:48.667610"], ["id", 1]]

    def destroy
        # byebug
        actor = Actor.find(params[:id])
        # byebug
        if actor.destroy
---
DELETE FROM "actors" WHERE "actors"."id" = ?  [["id", 1]]