app/controllers/characters_controller.rb

SELECT "characters".* FROM "characters"
---
    def index
        if params[:show_id]
            @characters = Character.find(params[:show_id]).characters
        else
            @characters = Character.all

SELECT "characters".* FROM "characters" WHERE "characters"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "characters" ("name", "bio", "show_id", "created_at", "updated_at", "actor_id") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Luffy"], ["bio", "Very Strong Dude"], ["show_id", 1], ["created_at", "2021-04-09 15:08:00.707293"], ["updated_at", "2021-04-09 15:08:00.707293"], ["actor_id", 1]]
INSERT INTO "shows" ("title", "air_time", "rating", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Pokemon"], ["air_time", 21], ["rating", 2.0], ["created_at", "2021-04-08 17:12:59.780925"], ["updated_at", "2021-04-08 17:12:59.780925"]]
INSERT INTO "characters" ("name", "bio", "show_id", "created_at", "updated_at", "actor_id") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Test"], ["bio", "Test"], ["show_id", 1], ["created_at", "2021-04-09 15:01:27.119111"], ["updated_at", "2021-04-09 15:01:27.119111"], ["actor_id", 1]]
INSERT INTO "characters" ("name", "bio", "show_id", "created_at", "updated_at", "actor_id") VALUES (?, ?, ?, ?, ?, ?)  [["name", "hhhh"], ["bio", "hhhh"], ["show_id", 4], ["created_at", "2021-04-09 15:04:39.327971"], ["updated_at", "2021-04-09 15:04:39.327971"], ["actor_id", 1]]
INSERT INTO "shows" ("title", "air_time", "rating", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "h"], ["air_time", 3], ["rating", 3.0], ["created_at", "2021-04-09 15:04:39.323995"], ["updated_at", "2021-04-09 15:04:39.323995"]]
---
    def create
        if no_show_attributes_in_character_params?
            if character_params_filled_out?
                if hacked?
                    redirect_to new_show_character_path(Character.find(params[:show_id]))
                else
                    @character = Character.create(character_params)
                    redirect_to @character
                end
            else
                # @character = Character.create(character_params)
                render :new
            end
        else
                if character_params_filled_out_with_show_attributes?
                    if show_id_in_character_params
                        @character = Character.create(name: character_params[:name], bio: character_params[:bio], show_id: character_params[:show_id], actor_id: character_params[:actor_id])
                        redirect_to @character
                    else
                        @character = Character.create(character_params)

SELECT "characters".* FROM "characters" WHERE "characters"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def show
        @character = Character.find(params[:id])

SELECT "characters".* FROM "characters" WHERE "characters"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def edit
        @character = Character.find(params[:id])

SELECT "characters".* FROM "characters" WHERE "characters"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "characters" SET "name" = ?, "bio" = ?, "updated_at" = ? WHERE "characters"."id" = ?  [["name", "Luffysss"], ["bio", "Very Strong Dudeman"], ["updated_at", "2021-04-09 15:27:14.710264"], ["id", 1]]
---
    def update
        # byebug
        character = Character.find(params[:id])
        character.update(character_params)

DELETE FROM "characters" WHERE "characters"."id" = ?  [["id", 1]]
---
    def destroy
        # byebug
        character = Character.find(params[:id])
        # byebug
        if character.destroy