app/controllers/characters_controller.rb

SELECT "shows".* FROM "shows" WHERE "shows"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def index
        if params[:show_id]
            @characters = Show.find(params[:show_id]).characters
        else
            @characters = Character.all

UPDATE "characters" SET "updated_at" = ? WHERE "characters"."id" = ?  [["updated_at", "2021-04-09 00:38:19.410476"], ["id", 3]]
---
    def update
        # byebug
        character = Character.find(params[:id])
        character.update(character_params)