app/controllers/comments_controller.rb

INSERT INTO "comments" ("show_id", "content", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["show_id", 1], ["content", "sssss"], ["created_at", "2021-04-08 18:05:43.638551"], ["updated_at", "2021-04-08 18:05:43.638551"], ["user_id", 1]]
---
    def create

       comment = Comment.create(content: comment_params[:content], show_id: comment_params[:show_id], user_id: session[:user_id])

SELECT "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 2]]
---
    def destroy
      comment = Comment.find(params[:id])
      show_id = comment.show_id
      if comment.user_id == session[:user_id]
        if comment.destroy