app/controllers/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "felisa.wind@gmail.com"], ["LIMIT", 1]]
---
    def create
        user = User.find_by_email(params[:user][:email])

SELECT "users".* FROM "users" WHERE "users"."uid" = ? AND "users"."name" = ? AND "users"."email" = ? AND "users"."username" = ? LIMIT ?  [["uid", "117860689234137033262"], ["name", "Krae Wind"], ["email", "kraewind@gmail.com"], ["username", "kraewind@gmail.com"], ["LIMIT", 1]]
INSERT INTO "users" ("name", "created_at", "updated_at", "email", "password_digest", "username", "uid", "image", "cvo") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
    def omniauth
      # byebug
      if User.find_by(uid: auth["uid"], name: auth['info']['name'], email: auth['info']['email'], username: auth['info']['email'])
        @user = User.find_by(uid: auth["uid"], name: auth['info']['name'], email: auth['info']['email'], username: auth['info']['email'])
      else
        @user = User.create(uid: auth["uid"], name: auth['info']['name'], email: auth['info']['email'], username: auth['info']['email'], password_digest: SecureRandom.hex(20)) do |u|