app/controllers/shows_controller.rb

SELECT "shows".* FROM "shows"
---
    def index
        @shows = Show.all

INSERT INTO "shows" ("title", "air_time", "rating", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "sdfg"], ["air_time", 33], ["rating", 3.0], ["created_at", "2021-04-07 20:37:23.222737"], ["updated_at", "2021-04-07 20:37:23.222737"]]
---
    def create
        # byebug
        @show = Show.create(show_params)

SELECT "shows".* FROM "shows" WHERE "shows"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
        @show = Show.find_by_id(params[:id])

SELECT "shows".* FROM "shows" WHERE "shows"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def edit
        @show = Show.find_by_id(params[:id])

SELECT "shows".* FROM "shows" WHERE "shows"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "shows" SET "air_time" = ?, "updated_at" = ? WHERE "shows"."id" = ?  [["air_time", 0], ["updated_at", "2021-04-08 23:30:47.913093"], ["id", 1]]
---
    def update
        # byebug
        @show = Show.find(params[:id])
        @show.update(show_params)

DELETE FROM "shows" WHERE "shows"."id" = ?  [["id", 1]]
---
    def destroy
        # byebug
        show = Show.find(params[:id])
        # byebug
        if show.destroy