app/controllers/users_controller.rb

    def create
        @user = User.create(user_params)
---
INSERT INTO "users" ("name", "dob", "admin", "created_at", "updated_at", "email", "password_digest", "username") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

    def show

        @user = User.find_by(id: session[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def edit

        @user = User.find_by(id: session[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def update
        @user = User.find_by_id(params[:id])
        @user.update(user_params)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "updated_at" = ?, "password_digest" = ? WHERE "users"."id" = ?  [["updated_at", "2021-04-08 23:19:09.259004"], ["password_digest", "$2a$12$Oox9WN5FpQ5lpLFkv20EseoF1aVUxxU3gWP8WVLBk6sFIWd4KVVJO"], ["id", 3]]