app/controllers/viewings_controller.rb

    def index
        @user = User.find(session[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def create
        # byebug
        @viewing = Viewing.create(time: viewing_params[:time], place: viewing_params[:place], show_id: viewing_params[:show_id], user_id: session[:user_id])
---
INSERT INTO "viewings" ("time", "place", "show_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["time", "2022-02-11 22:33:00"], ["place", "here"], ["show_id", 1], ["user_id", 4], ["created_at", "2021-04-08 23:29:07.557274"], ["updated_at", "2021-04-08 23:29:07.557274"]]

    def edit
        # byebug
        @viewing = Viewing.find_by_id(params[:id])
---
SELECT "viewings".* FROM "viewings" WHERE "viewings"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def update
        # byebug
        @viewing = Viewing.find(params[:id])
        @viewing.update(viewing_params)
---
SELECT "viewings".* FROM "viewings" WHERE "viewings"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "viewings" SET "time" = ?, "updated_at" = ? WHERE "viewings"."id" = ?  [["time", "111111-12-11 11:11:00"], ["updated_at", "2021-04-06 14:50:11.064071"], ["id", 1]]

    def destroy
        viewing = Viewing.find(params[:id])
        if viewing.user_id == session[:user_id]
            if viewing.destroy
---
SELECT "viewings".* FROM "viewings" WHERE "viewings"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
DELETE FROM "viewings" WHERE "viewings"."id" = ?  [["id", 1]]