app/views/shows/new.html.erb

SELECT "actors".* FROM "actors" ORDER BY "actors"."name" ASC
---
            <%= c.label :actor_id, class: "form-label"  %>
            <%= c.collection_select :actor_id, Actor.all, :id, :name, prompt: true, class: "form-label" %>