app/views/shows/show.html.erb

<ul>
    <% @show.comments.reverse.each do |c| %>
        <li><%=User.find_by_id(c.user_id).username%>: <%=c.content%>  <%=c.created_at.strftime("%m/%d/%y: %H:%M %Z")%></li>
---
SELECT "comments".* FROM "comments" WHERE "comments"."show_id" = ?  [["show_id", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]